docs/software_license.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>software-license</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="org6422df1">
<div class="navbar-brand" id="orgb45bc6a">
<div class="navbar-item" id="org7bad42c">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="org1cd344a">
<div class="navbar-start" id="orgd5d55d8">
<div class="navbar-item" id="orgc92551a">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="org043ec24">

</div>

</div>
</nav>
<div id="outline-container-org1c215d8" class="outline-2">
<h2 id="org1c215d8">software patents and licenses</h2>
<div class="outline-text-2" id="text-org1c215d8">
</div>
<div id="outline-container-orgd4668ed" class="outline-3">
<h3 id="orgd4668ed">notes</h3>
<div class="outline-text-3" id="text-orgd4668ed">
<ul class="org-ul">
<li>entirely too many hours wasted arguing about imaginary property</li>
<li>mostly moot as enforcement is sparse/scarce and trolling is high</li>
<li>US software patents are not really applicable to the eu (ex. france and x264)</li>
<li>arbitrary stifling as licenses/patents mean little to china/russia/iran/etc</li>
<li>DMCA/NTD
<ul class="org-ul">
<li>circumvention of arbitrary controls/locks on things you <b>OWN</b> is illegal and punishable by fines and incarceration
<ul class="org-ul">
<li>applied to cars, phones, video games, TVs, streaming services, etc</li>
</ul></li>
<li>'Fair Use' is willfully ignored</li>
<li>broken with false takedowns and no repercussions for violations of 'good faith belief' of infringement</li>
<li>trolled usenet postings mitigations
<ul class="org-ul">
<li>encrypted/scrambled/password protected files</li>
<li>remove 1 piece to make invalid but other providers remove different pieces to enable reconstruction</li>
</ul></li>
</ul></li>
<li>CLA signage usually gives away right to project
<ul class="org-ul">
<li>allows proprietary forks later that violate original license</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb7b40c4" class="outline-3">
<h3 id="orgb7b40c4">GPL</h3>
<div class="outline-text-3" id="text-orgb7b40c4">
</div>
<div id="outline-container-org3644b68" class="outline-4">
<h4 id="org3644b68">LGPL</h4>
<div class="outline-text-4" id="text-org3644b68">
<ul class="org-ul">
<li>non viral when linking but must allow replacement</li>
</ul>
</div>
</div>
<div id="outline-container-org50104be" class="outline-4">
<h4 id="org50104be">AGPL</h4>
<div class="outline-text-4" id="text-org50104be">
<ul class="org-ul">
<li>viral to providing service over network socket</li>
</ul>
</div>
</div>
<div id="outline-container-org9bff2eb" class="outline-4">
<h4 id="org9bff2eb">GPL</h4>
<div class="outline-text-4" id="text-org9bff2eb">
<ul class="org-ul">
<li>must provide source code, licenses, copyright notices etc
<ul class="org-ul">
<li>mark modified files with copyright and pointer to license</li>
<li>'should' print license if interactive</li>
</ul></li>
<li>internal use allowed w/o following license</li>
<li>copyleft viral
<ul class="org-ul">
<li>all linkage must be compatible license</li>
</ul></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org1681f45"></a>GPLv2<br>
<div class="outline-text-5" id="text-org1681f45">
<ul class="org-ul">
<li>can add exceptions such as classpath, gcc runtime, 'or later'</li>
</ul>
</div>
</li>
<li><a id="org5b68d47"></a>GPLv3<br>
<div class="outline-text-5" id="text-org5b68d47">
<ul class="org-ul">
<li>patent grant</li>
<li>anti tivoization
<ul class="org-ul">
<li>must allow replacement of software</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org8494682" class="outline-3">
<h3 id="org8494682">Apachev2</h3>
<div class="outline-text-3" id="text-org8494682">
<ul class="org-ul">
<li>grants patent</li>
<li>implied CLA (under same license) for project</li>
<li>must
<ul class="org-ul">
<li>reproduce license</li>
<li>mark files changed</li>
<li>include NOTICE files</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga1d4e53" class="outline-3">
<h3 id="orga1d4e53">MIT</h3>
<div class="outline-text-3" id="text-orga1d4e53">
<ul class="org-ul">
<li>must reproduce license and copyright notice</li>
</ul>
</div>
</div>
<div id="outline-container-orgbf85e7f" class="outline-3">
<h3 id="orgbf85e7f">BSD</h3>
<div class="outline-text-3" id="text-orgbf85e7f">
<ul class="org-ul">
<li>0BSD
<ul class="org-ul">
<li>no restrictions</li>
</ul></li>
<li>1 clause
<ul class="org-ul">
<li>must reproduce license with if given source</li>
</ul></li>
<li>2 clause
<ul class="org-ul">
<li>must reproduce license if given binary or source</li>
</ul></li>
<li>3 clause
<ul class="org-ul">
<li>must reproduce license if given binary or source</li>
<li>no endorsements from copyright holders</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf217ac9" class="outline-3">
<h3 id="orgf217ac9">misc</h3>
<div class="outline-text-3" id="text-orgf217ac9">
</div>
<div id="outline-container-org8939eac" class="outline-4">
<h4 id="org8939eac">public domain</h4>
<div class="outline-text-4" id="text-org8939eac">
<ul class="org-ul">
<li>no restrictions</li>
<li>ex. sqlite</li>
</ul>
</div>
</div>
<div id="outline-container-orgd308d77" class="outline-4">
<h4 id="orgd308d77">boost</h4>
<div class="outline-text-4" id="text-orgd308d77">
<ul class="org-ul">
<li>close to public domain for countries w/o the legal concept</li>
</ul>
</div>
</div>
<div id="outline-container-org9d52c99" class="outline-4">
<h4 id="org9d52c99">EPL</h4>
<div class="outline-text-4" id="text-org9d52c99">
<ul class="org-ul">
<li>v1
<ul class="org-ul">
<li>not GPL compatible</li>
<li>ex. clojure</li>
</ul></li>
<li>v2
<ul class="org-ul">
<li>incompatible with EPL v1</li>
<li>GPLv2 w/classpath exception for gpl compat
<ul class="org-ul">
<li>effectively makes combined works gplv2+classpath exception</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf4b2605" class="outline-4">
<h4 id="orgf4b2605">MPL</h4>
<div class="outline-text-4" id="text-orgf4b2605">
<ul class="org-ul">
<li>mozilla license is file based and allows some mixing</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
